app/views/orders/show.html.erb


  <% @order.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."order_id" = ?  [["order_id", 1]]