app/controllers/items_controller.rb

SELECT "products"."name_chin" FROM "products"
---
  def new
    @item = Item.new
    @product_list = Product.all.pluck(:name_chin)

INSERT INTO "items" ("product", "price", "quantity", "order_id", "created_at", "updated_at", "size") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product", "提拉米蘇"], ["price", 400], ["quantity", 3], ["order_id", 17], ["created_at", "2017-06-07 17:12:06.261329"], ["updated_at", "2017-06-07 17:12:06.261329"], ["size", "八吋"]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."order_id" = ?  [["order_id", 13]]
UPDATE "orders" SET "total_price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total_price", 1120], ["updated_at", "2017-06-07 15:32:47.883059"], ["id", 13]]
---
  def create
    if params[:flag] == "取消"
      redirect_to root_path
    else
      @item = Item.create(item_params)
      order = Order.find(params[:item][:order_id])

      if @item.save
        if params[:flag] == "繼續新增"
          redirect_to new_item_path(param: order.id)
        else
          order.total_price = get_price(order)
          if order.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "products"."name_chin" FROM "products"
---
  def edit
    @item = Item.find(params[:id])
    @product_select = @item.product
    @product_list = Product.all.pluck(:name_chin)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."order_id" = ?  [["order_id", 17]]
UPDATE "items" SET "product" = ?, "size" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["product", "藍莓蛋糕"], ["size", "六吋"], ["updated_at", "2017-06-07 17:14:43.537738"], ["id", 20]]
UPDATE "orders" SET "total_price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total_price", 500], ["updated_at", "2017-06-07 17:13:29.780982"], ["id", 17]]
---
  def update
    @item = Item.find(params[:id])
    order = Order.find(@item.order_id)

    if @item.update(item_params)