app/controllers/orders_controller.rb

  def create
    @order = Order.create(order_params)
---
INSERT INTO "orders" ("receiver", "phone", "method", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["receiver", ""], ["phone", ""], ["method", ""], ["address", ""], ["created_at", "2017-06-07 13:51:38.701025"], ["updated_at", "2017-06-07 13:51:38.701025"]]

  def update
    @order = Order.find(params[:id])

    if @order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "phone" = ?, "method" = ?, "paid" = ?, "note" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["phone", "123456"], ["method", "w"], ["paid", 12], ["note", ""], ["updated_at", "2017-06-07 16:52:02.235179"], ["id", 12]]