app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name_chin", "name_eng", "price", "created_at", "updated_at", "size") VALUES (?, ?, ?, ?, ?, ?)  [["name_chin", "藍莓蛋糕"], ["name_eng", "blueberry cake"], ["price", 400], ["created_at", "2017-06-02 16:21:48.018059"], ["updated_at", "2017-06-02 16:21:48.018059"], ["size", "八吋"]]

  def update
    @product = Product.find(params[:id])
    @product.size = params[:product][:size]

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name_chin" = ?, "name_eng" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name_chin", "提拉米蘇-六吋"], ["name_eng", "tiramisu-6inch"], ["price", 575], ["updated_at", "2017-05-29 12:48:50.314884"], ["id", 1]]